       01 CGI-FORM-FIELDS.
          05 FORM-DATA           PIC X(2048).
          05 FORM-PARAM-NAME     PIC X(40).
          05 FORM-PARAM-VALUE    PIC X(256).
          05 FORM-PARAM-FOUND    PIC X VALUE 'N'.