       01 CGI-RESPONSE-FIELDS.
          05 RESPONSE-OK         PIC X VALUE 'N'.
          05 RESPONSE-CODE       PIC X(32).
          05 RESPONSE-MESSAGE    PIC X(160).
          05 RESPONSE-FIELD      PIC X(40).