       01 PROJECT-RECORD.
          05 PROJECT-CODE        PIC X(32).
          05 PROJECT-CLIENT      PIC X(80).
          05 PROJECT-NAME        PIC X(80).
          05 PROJECT-CREATED-AT  PIC X(32).