       *> Project records are stored as readable pipe-delimited lines:
       *> project_code|client_name|project_name|created_at
       01 PROJECT-STORAGE-PATH PIC X(64) VALUE "data/projects.dat".